In [1]:
# reindexing :
# to create new object to data

# reindexing a series :

from pandas import Series
obj = Series([1, 2, 3, 4, 5], index=['a', 'b', 'c', 'd', 'e'])
obj

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [5]:
obj = obj.reindex(['i', 'j', 'k', 'l', 'm'])   # reindexing
obj

i   NaN
j   NaN
k   NaN
l   NaN
m   NaN
dtype: float64

In [7]:
# reindexing a dataframe :

from pandas import DataFrame
data = {'name':['john', 'tim', 'rob'],
       'age': [12, 13, 14],
       'salary': [100, 200, 300]
       }
frame = DataFrame(data)
frame

   name  age  salary
0  john   12     100
1   tim   13     200
2   rob   14     300

In [9]:
# reindexing frame (row):
frame = frame.reindex([2, 1, 0])
frame

   name  age  salary
2   rob   14     300
1   tim   13     200
0  john   12     100

In [12]:
# reindexing frame (col):
fields = ['age', 'salary', 'name']
frame = frame.reindex(columns=fields)

In [13]:
frame

   age  salary  name
2   14     300   rob
1   13     200   tim
0   12     100  john